{
	"___comment(1)___": "interface.py",

	"Código executado com sucesso.": "Code executed successfully.",
	"Configurar Auto Synced Translated Dubs || UI": "Set Auto Synced Translated Dubs || UI",
	"Configurações salvas com sucesso.": "Settings saved successfully.",
	"Configurações em batch.ini": "Settings in batch.ini",
	"Número de idiomas habilitados:": "Number of enabled languages:",
	"Caminho do vídeo original:": "Original video path:",
	"Procurar": "Browse",
	"Caminho do arquivo SRT:": "SRT file path:",
	"Configurações em cloud_service_settings.ini": "Settings in cloud_service_settings.ini",
	"Serviço de TTS:": "TTS Service:",
	"Serviço de Tradução:": "Translation Service:",
	"Usar Google Translate como fallback:": "Use Google Translate as fallback:",
	"Projeto ID da Google Cloud:": "Google Cloud Project ID:",
	"Chave da API da DeepL:": "DeepL API Key:",
	"Chave da API do Azure Speech:": "Azure Speech API Key:",
	"Região do Azure Speech:": "Azure Speech Region:",
	"Configurações em config.ini": "Settings in config.ini",
	"Pular Tradução:": "Skip Translation:",
	"Pular Síntese:": "Skip Synthesis:",
	"Parar após Tradução:": "Stop after Translation:",
	"Síntese de Voz em Duas Etapas:": "Two-Step Voice Synthesis:",
	"Forçar esticamento na segunda etapa:": "Force stretching in the second step:",
	"Modo de Depuração:": "Debug Mode:",
	"Idioma Original:": "Original Language:",
	"Preferência de Formalidade:": "Formality Preference:",
	"Formato de Saída:": "Output Format:",
	"Codificação de Áudio de Síntese:": "Synthesis Audio Encoding:",
	"Pausa após período (Azure):": "Pause after period (Azure):",
	"Taxa de Amostragem de Síntese:": "Synthesis Sample Rate:",
	"Máximo de caracteres para combinar legendas:": "Maximum characters to combine subtitles:",
	"Buffer de Linha em Milissegundos:": "Line Buffer in Milliseconds:",
	"Salvar Configurações": "Save Settings",
	"Executar": "Run",
	"e adaptações por": "and adaptations by",
	"Exit": "Exit",
	"Créditos": "Credits",

	"___comment(1.1)___": "interface.py (tooltips)",

	"Número de idiomas habilitados: Informe o número de idiomas que serão processados.": "Number of enabled languages: Enter the number of languages to be processed.",
	"Definido pelo arquivo": "Defined by file",
	"Se você quiser, você pode adicionar mais no arquivo": "If you want, you can add more in the file",
	"Caminho do vídeo original: Informe o caminho para o arquivo de vídeo de origem que esteja em MP4.": "Original video path: Enter the path to the source video file that is in MP4.",
	"Caminho do arquivo SRT: Informe o caminho para o arquivo de legenda no formato SRT.": "SRT file path: Enter the path to the subtitle file in SRT format.",
	"Qual serviço de tradução você usará? DeepL é mais lento, mas mais preciso": "Which translation service will you use? DeepL is slower but more accurate",
	"Nota: Se você pular a tradução, não é necessário": "Note: If you skip translation, it is not necessary",
	"Caso o idioma de tradução não seja suportado pelo DeepL, use o Google Translate como alternativa. Ignorado se o translate_service estiver definido como google.": "If the translation language is not supported by DeepL, use Google Translate as an alternative. Ignored if translate_service is set to google.",
	"O nome/ID do projeto no console do Google Cloud. Necessário para traduzir": "The name/ID of the project in the Google Cloud console. Required for translating",
	"Chave da API DeepL: Informe a chave da API para o serviço de tradução DeepL. Obrigatório para tradução 'deepl' estiver selecionado": "DeepL API Key: Enter the API key for the DeepL translation service. Required for translation if 'deepl' is selected.",
	"Chave de API para seu recurso de fala no Azure (fala cognitiva)": "API Key for your speech resource in Azure (cognitive speech)",
	"O local/região do recurso de fala. Isso deve estar listado na mesma página que as chaves de API.": "The location/region of the speech resource. This should be listed on the same page as the API keys.", 
	"Exemplo:": "Example:",
	"Maque se não quiser traduzir as legendas.": "Check if you do not want to translate the subtitles.",
	"Maque se não quiser sintetizar o áudio. Por exemplo, se você já fez isso e está testando": "Check if you do not want to synthesize the audio. For example, if you've already done this and are testing",
	"Maque se desejar interromper o programa após traduzir as legendas.": "Check if you want to stop the program after translating the subtitles.",
	"Por exemplo, se você quiser revisar manualmente as legendas resultantes antes de sintetizar o áudio.": "For example, if you want to manually review the resulting subtitles before synthesizing the audio.",
	"Observe que para retomar o processo, você deve definir novamente como False e definir skip_translation como True": "Note that to resume the process, you must reset to False and set skip_translation to True",
	"Isso melhorará drasticamente a qualidade do resultado final, MAS veja a nota abaixo.": "This will drastically improve the quality of the final result, BUT see the note below.",
	"Nota! Definir isso como verdadeiro fará com que, em vez de apenas esticar os clipes de áudio, a API gere novos clipes de áudio com taxas de fala ajustadas.": "Note! Setting this to true will cause the API to generate new audio clips with adjusted speech rates, instead of just stretching the audio clips.",
	"Isso não pode ser feito na primeira passagem porque não sabemos quanto tempo os clipes de áudio terão até que os geremos.": "This cannot be done in the first pass because we don't know how long the audio clips will be until we generate them.",
	"Funciona apenas no Google e Azure": "Works only in Google and Azure",
	"Obrigatório para": "Required for", 
	"e": "and",
	"Na segunda passagem, cada clipe de áudio ficará extremamente próximo da duração desejada, mas um pouco diferente.": "In the second pass, each audio clip will be extremely close to the desired duration but a little different.",
	"Defina como True se quiser esticar o clipe da segunda passagem de qualquer maneira para ser exato, até o milissegundo.": "Set to True if you want to stretch the second pass clip anyway to be exact, down to the millisecond.",
	"No entanto, isso degradará a voz e fará com que soe semelhante a se fosse apenas 1-Pass": "However, this will degrade the voice and make it sound similar to if it was just 1-Pass",
	"Principalmente evita que o programa exclua arquivos no diretório de trabalho e também gera arquivos para cada etapa de áudio.": "Mainly prevents the program from deleting files in the working directory and also generates files for each audio step.",
	"O código de idioma BCP-47 para o idioma do texto original.": "The BCP-47 language code for the language of the original text.",
	"Aplica-se apenas a traduções do DeepL - se deve usar uma linguagem mais ou menos formal.": "Applies only to DeepL translations - whether to use more or less formal language.",
	"O formato/codec do arquivo de áudio final.": "The format/codec of the final audio file.",
	"Deve ser um codec da seção 'Codificações de áudio compatíveis' aqui:": "Should be a codec from the 'Compatible Audio Encodings' section here:",
	"Isso determina o codec retornado pela API, não aquele produzido pelo programa! Você provavelmente não deveria mudar isso, caso contrário, pode não funcionar": "This determines the codec returned by the API, not the one produced by the program! You probably shouldn't change this or it might not work", 
	"Somente Azure: define a pausa exata em milissegundos que a voz TTS fará após um período entre as frases.": "Azure only: defines the exact pause in milliseconds that the TTS voice will make after a period between sentences.",
	"Defina-a como (padrão) para mantê-la padrão, o que é bastante lento. Acho que 80 ms é muito bom.": "Set it to (default) to keep it default, which is quite slow. I think 80ms is very good.",
	"Observação: alterar isso do padrão adiciona cerca de 60 caracteres por linha à contagem total de uso de caracteres do Azure": "Note: changing this from default adds about 60 characters per line to the total Azure character usage count",
	"Insira a taxa de amostragem nativa para o áudio de voz fornecido pelo serviço TTS": "Enter the native sample rate for the voice audio provided by the TTS service",
	"Isso geralmente é 24KHz (24.000), mas alguns serviços como o Azure oferecem áudio de qualidade superior a 48KHz (48.000)": "This is usually 24KHz (24,000) but some services like Azure offer higher quality 48KHz (48,000) audio",
	"Insira apenas dígitos numéricos, sem vírgulas ou qualquer coisa": "Enter only numeric digits, no commas or anything",
	"Se a combinação de duas linhas de legenda adjacentes estiver abaixo desse valor, e uma começar ao mesmo tempo que a outra termina, as linhas serão combinadas.": "If the combination of two adjacent subtitle lines is below this value, and one starts at the same time the other ends, the lines will be combined.",
	"Isso deve melhorar a síntese de fala, reduzindo divisões não naturais em frases faladas.": "This should improve speech synthesis, reducing unnatural splits in spoken sentences.",
	"Definir como zero ou um número baixo irá efetivamente desativá-lo": "Setting to zero or a low number will effectively disable it",
	"Adiciona um buffer de silêncio entre cada clipe falado, mas mantém a fala 9centralizada) no local certo para que ainda esteja sincronizada": "Adds a silence buffer between each spoken clip, but keeps the speech 9centerized) in the right place so it's still in sync",
	"Para deixar claro, a duração total do arquivo de áudio permanecerá a mesma, cada clipe falado será reduzido dentro dele": "To be clear, the total duration of the audio file will remain the same, each spoken clip will be shrunk within it", 
	"Útil se o seu arquivo de legendas colocar todos os tempos de início e fim um contra o outro": "Useful if your subtitle file places all start and end times right up against each other",
	"Observe que isso se aplica antes e depois, então o total extra entre os clipes será 2x isso": "Note this applies before and after, so the total extra between clips will be 2x this",
	"Aviso, definir um valor muito alto pode fazer com que o TTS fale extremamente rápido para caber na duração restante do clipe": "Warning, setting too high can make the TTS speak extremely fast to fit the remaining clip duration",
	"Cerca de 25 a 50 milissegundos é um bom ponto de partida": "Around 25 to 50 milliseconds is a good starting point",
	"Somente Azure: define a pausa exata em milissegundos que a voz TTS fará após uma vírgula.": "Azure only: defines the exact pause in milliseconds that the TTS voice will make after a comma.",
	"Defina-a como (padrão) para mantê-la padrão, o que é bastante lento.": "Set it to (default) to keep it default, which is quite slow.",
	"Parece que esse número não segue exatamente e parece seguir tem um mínimo de cerca de 50 ms": "It seems this number doesn't follow exactly and seems to have a minimum of around 50ms",
	"Observação: alterar o padrão adiciona cerca de 60 caracteres por linha à contagem total de uso de caracteres do Azure": "Note: changing from default adds about 60 characters per line to the total Azure character usage count",
    "Escolha o Serviço de TTS que deseja utilizar, Google e Azure é obrigatório por a API": "Choose the TTS Service you want to use, Google and Azure are required by the API",
    "Bark Utiliza 100% de VRAM de uma 3060 e demora em média 1 minuto pra gerar cada linha de áudio": "Bark uses 100% of VRAM of a 3060 and takes an average of 1 minute to generate each line of audio", 
    "Bark e Edge não há necessidade de API": "Bark and Edge do not require API",

	"___comment(2)___": "main.py",

	"Auto Synced Translated Dubs": "Auto Synced Translated Dubs",
	"script by": "script by",
	"Release version": "Release version",
	"Pre-translated file found": "Pre-translated file found",
	"Beginning Processing of Language": "Beginning Processing of Language",
	"Beginning Processing of Languages": "Beginning Processing of Languages",
	"Original language is the same as the target language. Skipping translation.": "Original language is the same as the target language. Skipping translation.",
	"Stopping at translation is enabled. Skipping TTS and building audio.": "Stopping at translation is enabled. Skipping TTS and building audio.",
	"Skip translation enabled. Checking for pre-translated subtitles...": "Skip translation enabled. Checking for pre-translated subtitles...",
	"Pre-translated subtitles not found for language": "Pre-translated subtitles not found for language",
	"Skipping": "Skipping",

	"___comment(3)___": "audio_builder.py",

	"Trimmed Audio": "Trimmed Audio",
	"of": "of",
	"Calculated Speed Factor": "Calculated Speed Factor",
	"Trimmed Audio (2nd Pass)": "Trimmed Audio (2nd Pass)",
	"Calculated Speed Factor (2nd Pass)": "Calculated Speed Factor (2nd Pass)",
	"Final Audio Processed": "Final Audio Processed",
	"\nExporting audio file...": "\nExporting audio file...",
	"\nThere was an issue exporting the audio, it might be a permission error. The file was saved as a backup with the extension .bak": "\nThere was an issue exporting the audio, it might be a permission error. The file was saved as a backup with the extension .bak",
	"Try removing the .bak extension then listen to the file to see if it worked.\n": "Try removing the .bak extension then listen to the file to see if it worked.\n",
	"Press Enter to exit...": "Press Enter to exit...",

	"___comment(4)___": "TTS.py",

	"Error Message: ": "Error Message: ",
	"Waiting 65 seconds to try again": "Waiting 65 seconds to try again",
	"Trying again...": "Trying again...",
	"Press Enter to continue...": "Press Enter to continue...",
	"Payload will be broken up into": "Payload will be broken up into",
	"requests (due to Azure size limitations)": "requests (due to Azure size limitations)",
	"Batch synthesis job succeeded": "Batch synthesis job succeeded",
	"ERROR: Batch synthesis job failed!": "ERROR: Batch synthesis job failed!",
	"Reason:": "Reason:",
	"Batch synthesis job is still running, status": "Batch synthesis job is still running, status",
	"ERROR: Batch TTS only supports azure at this time": "ERROR: Batch TTS only supports azure at this time",
	"Press enter to exit...": "Press enter to exit...",
	"Error creating directory": "Error creating directory",
	"Synthesizing TTS Line:": "Synthesizing TTS Line:",
	"Synthesizing TTS Line (2nd Pass):": "Synthesizing TTS Line (2nd Pass):"
}