{
	"___comment(1)___": "interface.py",

	"Código executado com sucesso.": "Código ejecutado con éxito.",
	"Configurar Auto Synced Translated Dubs || UI": "Configurar Auto Synced Translated Dubs || UI",
	"Configurações salvas com sucesso.": "Configuraciones guardadas con éxito.",
	"Configurações em batch.ini": "Configuraciones en batch.ini",
	"Número de idiomas habilitados:": "Número de idiomas habilitados:",
	"Caminho do vídeo original:": "Ruta del video original:",
	"Procurar": "Buscar",
	"Caminho do arquivo SRT:": "Ruta del archivo SRT:",
	"Configurações em cloud_service_settings.ini": "Configuraciones en cloud_service_settings.ini",
	"Serviço de TTS:": "Servicio de TTS:",
	"Serviço de Tradução:": "Servicio de Traducción:",
	"Usar Google Translate como fallback:": "Usar Google Translate como recurso alternativo:",
	"Projeto ID da Google Cloud:": "ID de Proyecto de Google Cloud:",
	"Chave da API da DeepL:": "Clave de API de DeepL:",
	"Chave da API do Azure Speech:": "Clave de API de Azure Speech:",
	"Região do Azure Speech:": "Región de Azure Speech:",
	"Configurações em config.ini": "Configuraciones en config.ini",
	"Pular Tradução:": "Saltar Traducción:",
	"Pular Síntese:": "Saltar Síntesis:",
	"Parar após Tradução:": "Detener después de Traducción:",
	"Síntese de Voz em Duas Etapas:": "Síntesis de Voz en Dos Etapas:",
	"Forçar esticamento na segunda etapa:": "Forzar estiramiento en la segunda etapa:",
	"Modo de Depuração:": "Modo de Depuración:",
	"Idioma Original:": "Idioma Original:",
	"Preferência de Formalidade:": "Preferencia de Formalidad:",
	"Formato de Saída:": "Formato de Salida:",
	"Codificação de Áudio de Síntese:": "Codificación de Audio de Síntesis:",
	"Pausa após período (Azure):": "Pausa después de periodo (Azure):",
	"Taxa de Amostragem de Síntese:": "Tasa de Muestreo de Síntesis:", 
	"Máximo de caracteres para combinar legendas:": "Máximo de caracteres para combinar subtítulos:",
	"Buffer de Linha em Milissegundos:": "Búfer de Línea en Milisegundos:",
	"Salvar Configurações": "Guardar Configuraciones",
	"Executar": "Ejecutar",
	"e adaptações por": "y adaptaciones por",
	"Salir": "Salir",
	"Créditos": "Créditos",

	"___comment(1.1)___": "interface.py (tooltips)",

	"Número de idiomas habilitados: Informe o número de idiomas que serão processados.": "Número de idiomas habilitados: Ingrese la cantidad de idiomas que serán procesados.",
	"Definido pelo arquivo": "Definido por el archivo",
	"Se você quiser, você pode adicionar mais no arquivo": "Si quiere, puede agregar más en el archivo",   
	"Caminho do vídeo original: Informe o caminho para o arquivo de vídeo de origem que esteja em MP4.": "Ruta del video original: Ingrese la ruta del archivo de video fuente que esté en MP4.",
	"Caminho do arquivo SRT: Informe o caminho para o arquivo de legenda no formato SRT.": "Ruta del archivo SRT: Ingrese la ruta del archivo de subtitulo en formato SRT.",
	"Qual serviço de tradução você usará? DeepL é mais lento, mas mais preciso": "¿Qué servicio de traducción usarás? DeepL es más lento pero más preciso",
	"Nota: Se você pular a tradução, não é necessário": "Nota: Si omites la traducción, no es necesario",
	"Caso o idioma de tradução não seja suportado pelo DeepL, use o Google Translate como alternativa. Ignorado se o translate_service estiver definido como google.": "Si el idioma de traducción no es compatible con DeepL, use Google Translate como alternativa. Ignorado si translate_service está configurado como google.",
	"O nome/ID do projeto no console do Google Cloud. Necessário para traduzir": "El nombre/ID del proyecto en la consola de Google Cloud. Necesario para traducir", 
	"Chave da API DeepL: Informe a chave da API para o serviço de tradução DeepL. Obrigatório para tradução 'deepl' estiver selecionado": "Clave API de DeepL: Ingrese la clave de API para el servicio de traducción DeepL. Obligatorio para la traducción si 'deepl' está seleccionado.",
	"Chave de API para seu recurso de fala no Azure (fala cognitiva)": "Clave de API para su recurso de voz en Azure (voz cognitiva)",
	"O local/região do recurso de fala. Isso deve estar listado na mesma página que as chaves de API.": "La ubicación/región del recurso de voz. Esto debe estar listado en la misma página que las claves de API.",
	"Exemplo:": "Ejemplo:",
	"Maque se não quiser traduzir as legendas.": "Marque si no desea traducir los subtítulos.",
	"Maque se não quiser sintetizar o áudio. Por exemplo, se você já fez isso e está testando": "Marque si no desea sintetizar el audio. Por ejemplo, si ya lo hizo y está probando",
	"Maque se desejar interromper o programa após traduzir as legendas.": "Marque si desea detener el programa después de traducir los subtítulos.",
	"Por exemplo, se você quiser revisar manualmente as legendas resultantes antes de sintetizar o áudio.": "Por ejemplo, si desea revisar manualmente los subtítulos resultantes antes de sintetizar el audio.", 
	"Observe que para retomar o processo, você deve definir novamente como False e definir skip_translation como True": "Tenga en cuenta que para reanudar el proceso, debe restablecer a False y establecer skip_translation como True",
	"Isso melhorará drasticamente a qualidade do resultado final, MAS veja a nota abaixo.": "Esto mejorará drásticamente la calidad del resultado final, PERO vea la nota a continuación.",
	"Nota! Definir isso como verdadeiro fará com que, em vez de apenas esticar os clipes de áudio, a API gere novos clipes de áudio com taxas de fala ajustadas.": "Nota: Establecer esto en verdadero hará que la API genere nuevos clips de audio con tasas de voz ajustadas, en lugar de simplemente estirar los clips de audio.",
	"Isso não pode ser feito na primeira passagem porque não sabemos quanto tempo os clipes de áudio terão até que os geremos.": "Esto no se puede hacer en el primer pase porque no sabemos cuánto durarán los clips de audio hasta que los generemos.",
	"Funciona apenas no Google e Azure": "Funciona solo en Google y Azure",
	"Obrigatório para": "Obligatorio para",
	"e": "y",
	"Na segunda passagem, cada clipe de áudio ficará extremamente próximo da duração desejada, mas um pouco diferente.": "En el segundo pase, cada clip de audio estará extremadamente cerca de la duración deseada pero un poco diferente.",
	"Defina como True se quiser esticar o clipe da segunda passagem de qualquer maneira para ser exato, até o milissegundo.": "Establézcalo en True si desea estirar el clip del segundo paso de todos modos para que sea exacto, hasta el milisegundo.",
	"No entanto, isso degradará a voz e fará com que soe semelhante a se fosse apenas 1-Pass": "Sin embargo, esto degradará la voz y hará que suene similar a si fuera solo 1 pase",
	"Principalmente evita que o programa exclua arquivos no diretório de trabalho e também gera arquivos para cada etapa de áudio.": "Principalmente evita que el programa elimine archivos en el directorio de trabajo y también genera archivos para cada paso de audio.",
	"O código de idioma BCP-47 para o idioma do texto original.": "El código de idioma BCP-47 para el idioma del texto original.",
	"Aplica-se apenas a traduções do DeepL - se deve usar uma linguagem mais ou menos formal.": "Se aplica solo a traducciones de DeepL: si se debe usar un lenguaje más o menos formal.",
	"O formato/codec do arquivo de áudio final.": "El formato/códec del archivo de audio final.",
	"Deve ser um codec da seção (Codificações de áudio compatíveis) aqui::": "Debe ser un códec de la sección 'Codificaciones de audio compatibles' aquí:",
	"Isso determina o codec retornado pela API, não aquele produzido pelo programa! Você provavelmente não deveria mudar isso, caso contrário, pode não funcionar": "Esto determina el códec devuelto por la API, no el producido por el programa. Probablemente no debería cambiar esto o podría no funcionar",
	"Somente Azure: define a pausa exata em milissegundos que a voz TTS fará após um período entre as frases.": "Solo Azure: define la pausa exacta en milisegundos que hará la voz TTS después de un período entre oraciones.",
	"Defina-a como (padrão) para mantê-la padrão, o que é bastante lento. Acho que 80 ms é muito bom.": "Déjela como (predeterminada) para mantenerla predeterminada, lo cual es bastante lento. Creo que 80 ms es muy bueno.",
	"Observação: alterar isso do padrão adiciona cerca de 60 caracteres por linha à contagem total de uso de caracteres do Azure": "Nota: cambiar esto del valor predeterminado agrega aproximadamente 60 caracteres por línea al recuento total de uso de caracteres de Azure",
	"Insira a taxa de amostragem nativa para o áudio de voz fornecido pelo serviço TTS": "Ingrese la tasa de muestreo nativa para el audio de voz proporcionado por el servicio TTS",
	"Isso geralmente é 24KHz (24.000), mas alguns serviços como o Azure oferecem áudio de qualidade superior a 48KHz (48.000)": "Esto generalmente es 24KHz (24,000) pero algunos servicios como Azure ofrecen audio de mayor calidad a 48KHz (48,000)",
	"Insira apenas dígitos numéricos, sem vírgulas ou qualquer coisa": "Ingrese solo dígitos numéricos, sin comas ni nada",
	"Se a combinação de duas linhas de legenda adjacentes estiver abaixo desse valor, e uma começar ao mesmo tempo que a outra termina, as linhas serão combinadas.": "Si la combinación de dos líneas de subtítulo adyacentes está por debajo de este valor, y una empieza al mismo tiempo que termina la otra, se combinarán las líneas.",
	"Isso deve melhorar a síntese de fala, reduzindo divisões não naturais em frases faladas.": "Esto debería mejorar la síntesis del habla, reduciendo divisiones no naturales en frases habladas.",
	"Definir como zero ou um número baixo irá efetivamente desativá-lo": "Establecer en cero o un número bajo lo desactivará efectivamente",
	"Adiciona um buffer de silêncio entre cada clipe falado, mas mantém a fala 9centralizada) no local certo para que ainda esteja sincronizada": "Agrega un buffer de silencio entre cada clip hablado, pero mantiene el habla (centralizada) en el lugar correcto para que aún esté sincronizado",
	"Para deixar claro, a duração total do arquivo de áudio permanecerá a mesma, cada clipe falado será reduzido dentro dele": "Para aclarar, la duración total del archivo de audio seguirá siendo la misma, cada clip hablado se reducirá dentro de él",
	"Útil se o seu arquivo de legendas colocar todos os tempos de início e fim um contra o outro": "Útil si su archivo de subtítulos coloca todos los tiempos de inicio y finalización uno contra otro",
	"Observe que isso se aplica antes e depois, então o total extra entre os clipes será 2x isso": "Tenga en cuenta que esto se aplica antes y después, por lo que el total extra entre clips será 2x esto",
	"Aviso, definir um valor muito alto pode fazer com que o TTS fale extremamente rápido para caber na duração restante do clipe": "Advertencia: establecer un valor demasiado alto puede hacer que el TTS hable extremadamente rápido para que quepa en la duración restante del clip",
	"Cerca de 25 a 50 milissegundos é um bom ponto de partida": "Alrededor de 25 a 50 milisegundos es un buen punto de partida",
	"Somente Azure: define a pausa exata em milissegundos que a voz TTS fará após uma vírgula.": "Solo Azure: define la pausa exacta en milisegundos que hará la voz TTS después de una coma.",
	"Defina-a como (padrão) para mantê-la padrão, o que é bastante lento.": "Establézcala en (predeterminada) para mantenerla predeterminada, lo cual es bastante lento.",
	"Parece que esse número não segue exatamente e parece seguir tem um mínimo de cerca de 50 ms": "Parece que este número no sigue exactamente y parece tener un mínimo de alrededor de 50 ms",
	"Observação: alterar o padrão adiciona cerca de 60 caracteres por linha à contagem total de uso de caracteres do Azure": "Nota: cambiar el valor predeterminado agrega aproximadamente 60 caracteres por línea al recuento total de uso de caracteres de Azure",
	"Escolha o Serviço de TTS que deseja utilizar, Google e Azure é obrigatório por a API": "Elija el Servicio TTS que desea utilizar, Google y Azure son obligatorios por la API",
    "Bark Utiliza 100% de VRAM de uma 3060 e demora em média 1 minuto pra gerar cada linha de áudio": "Bark utiliza 100% de VRAM de una 3060 y tarda un promedio de 1 minuto para generar cada línea de audio",
    "Bark e Edge não há necessidade de API": "Bark y Edge no requieren API",

	"___comment(2)___": "main.py",

	"Auto Synced Translated Dubs": "Auto Synced Translated Dubs",
	"script by": "desarrollado por",
	"Release version": "Versión de lanzamiento",
	"Pre-translated file found": "Archivo pretraducido encontrado",
	"Beginning Processing of Language": "Comenzando procesamiento de idioma",
	"Beginning Processing of Languages": "Comenzando procesamiento de idiomas",
	"Original language is the same as the target language. Skipping translation.": "El idioma original es el mismo que el idioma objetivo. Omitiendo traducción.",
	"Stopping at translation is enabled. Skipping TTS and building audio.": "Detener en traducción está habilitado. Omitiendo TTS y construcción de audio.",
	"Skip translation enabled. Checking for pre-translated subtitles...": "Omitir traducción habilitado. Buscando subtítulos pretraducidos...",
	"Pre-translated subtitles not found for language": "Subtítulos pretraducidos no encontrados para el idioma",
	"Skipping": "Omitiendo",

	"___comment(3)___": "audio_builder.py",

	"Trimmed Audio": "Audio recortado",
	"of": "de",
	"Calculated Speed Factor": "Factor de velocidad calculado",
	"Trimmed Audio (2nd Pass)": "Audio recortado (2da pasada)",
	"Calculated Speed Factor (2nd Pass)": "Factor de velocidad calculado (2da pasada)",
	"Final Audio Processed": "Audio final procesado",
	"\nExporting audio file...": "\nExportando archivo de audio...",
	"\nThere was an issue exporting the audio, it might be a permission error. The file was saved as a backup with the extension .bak": "\nHubo un problema al exportar el audio, puede ser un error de permisos. El archivo se guardó como copia de seguridad con la extensión .bak",
	"Try removing the .bak extension then listen to the file to see if it worked.\n": "Intente quitar la extensión .bak y luego escuche el archivo para ver si funcionó.\n",
	"Press Enter to exit...": "Presione Enter para salir...",

	"___comment(4)___": "TTS.py",

	"Error Message: ": "Mensaje de error: ",
	"Waiting 65 seconds to try again": "Esperando 65 segundos para intentar de nuevo",  
	"Trying again...": "Intentando de nuevo...",
	"Press Enter to continue...": "Presione Enter para continuar...",
	"Payload will be broken up into": "La carga útil se dividirá en",
	"requests (due to Azure size limitations)": "solicitudes (debido a las limitaciones de tamaño de Azure)",
	"Batch synthesis job succeeded": "Trabajo de síntesis por lotes exitoso",
	"ERROR: Batch synthesis job failed!": "ERROR: ¡Falló el trabajo de síntesis por lotes!",
	"Reason:": "Motivo:",
	"Batch synthesis job is still running, status": "El trabajo de síntesis por lotes aún se está ejecutando, estado",
	"ERROR: Batch TTS only supports azure at this time": "ERROR: La síntesis por lotes de TTS solo admite azure en este momento",
	"Press enter to exit...": "Presione enter para salir...",
	"Error creating directory": "Error al crear directorio",
	"Synthesizing TTS Line:": "Sintetizando línea TTS:",
	"Synthesizing TTS Line (2nd Pass):": "Sintetizando línea TTS (2da pasada):"
}